<?php
//5. Дан код:

class A {
    public function foo() {
        static $x = 0;
        echo ++$x;
    }
}
$a1 = new A();
$a2 = new A();
$a1->foo();
$a2->foo();
$a1->foo();
$a2->foo();
//Что он выведет на каждом шаге? Почему?

//Вывод: 1234. Каждый объект работает со статистической Х в публичной функции родительского класса, поэтому она меняется каждый раз.


//    Немного изменим п.5:

class A {
    public function foo() {
        static $x = 0;
        echo ++$x;
    }
}
class B extends A {
}
$a1 = new A();
$b1 = new B();
$a1->foo();
$b1->foo();
$a1->foo();
$b1->foo();
//6. Объясните результаты в этом случае.

//Вывод: 1122. В данном случае каждый объект создан из разных классов и меняет Х в своем классе.


//7. *Дан код:

class A {
    public function foo() {
        static $x = 0;
        echo ++$x;
    }
}
class B extends A {
}
$a1 = new A;
$b1 = new B;
$a1->foo();
$b1->foo();
$a1->foo();
$b1->foo();
//Что он выведет на каждом шаге? Почему?

//Вывод: 1122. Код идентичен предыдущему заданию.